Feature: Ввод числа и получение сообщения о введенном значении

  Scenario: ใส่ตัวเลข แล้วกด Fab
    Given แสดงหน้าหลัก
    When เมื่อพิมพ์ "123"
    And กดปุ่ม "FAB"
    Then แสดงข้อความ "Вы ввели 123"

  Scenario: ใส่ตัวหนังสือ แล้วกด Fab
    Given แสดงหน้าหลัก
    When เมื่อพิมพ์ "abc"
    And กดปุ่ม "FAB"
    Then появляется сообщение "Ошибка! Введите число"

  Scenario: Пользователь жмет на Fab-кнопку не вводя число
    Given แสดงหน้าหลัก
    When ไม่กรอกข้อมูล
    And กดปุ่ม "FAB"
    Then แสดงข้อความ "Ошибка! Введите число"